; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 91164 1 3 3 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	Star3 - direction
	Star0 - direction
	Star1 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Phenomenon4 spectrograph1)
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 thermograph0)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 spectrograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star0 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 1 of 6
5. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 2 of 6
6. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 1 of 6
7. (take_image satellite0 planet6 instrument0 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 2 of 6
8. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   goals met: 3 of 6
9. (turn_to satellite0 phenomenon8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 6
10. (take_image satellite0 phenomenon8 instrument0 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 3 of 6
11. (turn_to satellite0 star7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star7)
   goals met: 4 of 6
12. (turn_to satellite0 phenomenon5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 6
13. (take_image satellite0 phenomenon5 instrument0 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 4 of 6
14. (turn_to satellite0 star7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star7)
   goals met: 5 of 6
15. (turn_to satellite0 phenomenon4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon4)
   goals met: 4 of 6
16. (take_image satellite0 phenomenon4 instrument0 spectrograph1)
   added: (have_image phenomenon4 spectrograph1)
   goals met: 5 of 6
17. (turn_to satellite0 star7 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star7)
   goals met: 6 of 6
